# Реализовать скрипт, в котором должна быть предусмотрена функция расчета заработной платы сотрудника.
# В расчете необходимо использовать формулу: (выработка в часах * ставка в час) + премия. Для выполнения
# расчета для конкретных значений необходимо запускать скрипт с параметрами.
from sys import argv

script_name, time, cost, bonus = argv
try:
    print(int(time) * int(cost) + int(bonus))
except ValueError as e:
    print(f'Ошибка {e}')
