# Создать (программно) текстовый файл, записать в него программно набор чисел,
# разделенных пробелами. Программа должна подсчитывать сумму чисел в файле и выводить ее на экран.


nums = [12, 23, 467, 98, 23.6, 6543, 58.65644, 987, 454, 0.003]
obj_f = open('lesson5_5.txt', 'w')
nums_for_write = ' '.join([str(elem) for elem in nums])
obj_f.write(nums_for_write + '\n')
print(sum(nums))
