# Необходимо создать (не программно) текстовый файл, где каждая строка описывает учебный предмет
# и наличие лекционных, практических и лабораторных занятий по этому предмету и их количество.
# Важно, чтобы для каждого предмета не обязательно были все типы занятий. Сформировать словарь,
# содержащий название предмета и общее количество занятий по нему. Вывести словарь на экран.
# Примеры строк файла:
# Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
#
# Пример словаря:
# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}
from re import findall

final_dict = dict()
with open('lesson5_6.txt') as obj_f:
    for cur_string in obj_f:
        subj_info = cur_string.split(':')
        lessons = [int(el) for el in findall('\d+', subj_info[1])]
        final_dict.update({subj_info[0]: sum(lessons)})

print(final_dict)
