# Спортсмен занимается ежедневными пробежками. В первый день его результат
# составил a километров. Каждый день спортсмен увеличивал результат на 10 %
# относительно предыдущего. Требуется определить номер дня, на который общий
# результат спортсмена составить не менее b километров. Программа должна принимать
# значения параметров a и b и выводить одно натуральное число — номер дня.

start_distance = int(input('Укажите начальную дистанцию в км: '))
goal_distance = int(input('Укажите целевую дистанцию в км: '))
day = 1

while goal_distance > start_distance:
    day += 1
    start_distance = start_distance + 0.1 * start_distance

print(f'На {day}-й день спортсмен достиг результата — не менее {goal_distance} км')