# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента. Использовать функцию type()
# для проверки типа. Элементы списка можно не запрашивать у пользователя, а указать явно, в программе.

my_list = [12, True, 56.7, 34, None, 'text1', 'test2', ['q', 'vf', 4]]

print(my_list)
for list_item in my_list:
    print(f'Тип данных {list_item}: {type(list_item)}')
