# Для списка реализовать обмен значений соседних элементов, т.е. Значениями
# обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д. При нечетном количестве
# элементов последний сохранить на своем месте. Для заполнения списка элементов
# необходимо использовать функцию input().

string_input = input("Введите список, разделяя элементы пробелом: ")
my_list = string_input.split(' ')

print(f'Вы ввели список: {my_list}')
print('Меняем соседние результаты')

index = 0
while index < len(my_list):
    if index % 2 != 1:
        buffer = my_list.pop(index)
        my_list.insert(index + 1, buffer)
    index += 1

print(f'Список после изменения: {my_list}')
