# Пользователь вводит строку из нескольких слов, разделённых пробелами.
# ывести каждое слово с новой строки. Строки необходимо пронумеровать. Если
# слово длинное, выводить только первые 10 букв в слове.

string_input = input("Введите строку из нескольких слов, разделяя элементы пробелом: ")
my_list = string_input.split(' ')

for index, word in enumerate(my_list):
    print(f'{index + 1}. {word[:10]}')
