# Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в
# виде функции my_func(x, y). При решении задания необходимо обойтись без встроенной
# функции возведения числа в степень.
#
# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с
# помощью оператора **. Второй — более сложная реализация без оператора **, предусматривающая использование цикла.


# возведение в степень с помощью оператора **
def my_func(num_1, num_2):
    if num_2 >= 0 or num_1 == 0 or type(num_2) is not int:
        return
    else:
        num_res = 1 / num_1 ** abs(num_2)
        return num_res


# возведение в степень без оператора **, предусматривающая использование цикла.
def my_func_loop(num_1, num_2):
    if type(num_2) is not int or num_2 >= 0 or num_1 == 0:
        return
    else:
        num_res = 1
        for el in range(abs(num_2)):
            num_res *= 1 / num_1
        return num_res


# проверка функцмй
test_data = ([2, -2], [0.5, -3], [23.5, -6], [1, -3.2], [8.34344, -2], [0.343434, -2])

for el in test_data:
    print(f'Тестовые данные: {el}')
    print(f'Результат my_func с оператором **: {my_func(el[0], el[1])}')
    print(f'Результат my_func без оператора **: {my_func_loop(el[0], el[1])}')
    print(f'Результат встроенной функции pow(): {pow(el[0], el[1])}')
